let input = document.querySelector('#inp')
let text = document.querySelector('#inner')
let count = document.querySelector('#count')
let counter = 0
let random

let array = ['агронОмія', 'алкогОль', 'алфАвіт', 'Аркушик', 'асиметрІя', 'багаторазОвий', 'безпринцИпний', 'бЕшкет', 'блАговіст', 'близькИй', 'болотИстий', 'борОдавка', 'босОніж', 'боЯзнь', 'бурштинОвий', 'бюлетЕнь', 'вАги', 'вантажІвка', 'веснЯний', 'видАння', 'визвОльний', 'вимОга', 'вИпадок', 'вирАзний', 'вИсіти', 'вИтрата', 'вишИваний', 'відвезтИ', 'відвестИ', 'вІдгомін', 'віднестИ', 'відОмість', 'вІрші', 'віршовИй', 'вітчИм', 'гальмО', 'гАльм', 'глибоко', 'глядАч', 'горошинА', 'граблІ', 'громАдський', 'гуртОжиток', 'данИна', 'дАно', 'децимЕтр', 'дЕщиця', 'де-Юре', 'джерелО', 'дИвлячись', 'дичАвіти', 'діалОг', 'добовИй', 'добУток', 'довезтИ', 'довестИ', 'довІдник', 'дОгмат', 'донестИ', 'дОнька', 'дочкА', 'дрОва', 'експЕрт', 'єретИк', 'жадОба', 'жалюзІ', 'живОпис', 'завдАння', 'завезтИ', 'завестИ', 'завждИ', 'завчасУ', 'зАгадка', 'заіржАвілий', 'заіржАвіти', 'закінчИти', 'зАкладка', 'зАкрутка', 'залишИти', 'замІжня', 'заробІток', 'зАставка', 'зАстібка', 'застОпорити', 'звИсока', 'здАлека', 'зібрАння', 'зобразИти', 'зОзла', 'зрАння', 'зрУчний', 'зубОжіння', 'індУстрія', 'кАмбала', 'каталОг', 'квартАл', 'кИшка', 'кіломЕтр', 'кінчИти', 'кОлія', 'корИсний', 'к1сний', 'котрИй', 'крОїти', 'кропивА', 'кулінАрія', 'кУрятина', 'лАте', 'листопАд', 'літОпис', 'лЮстро', 'мАбУть', 'магістЕрсьий', 'мАркетинг', 'мерЕжа', 'металУргія', 'мілімЕтр', 'монолОг', 'навчАння', 'нанестИ', 'нАчинка', 'ненАвидіти', 'ненАвисний', 'ненАвисть', 'нестИ', 'нІздря', 'новИй', 'обіцЯнка', 'обрАння', 'обрУч', 'одинАдцять', 'одноразОвий', 'ознАка', 'Олень', 'оптОвий', 'осетЕр', 'отАман', 'Оцет', 'павИч', 'партЕр', 'перевезтИ', 'перевестИ', 'перЕкис', 'перелЯк', 'перенестИ', 'перЕпад', 'перЕпис', 'піалА', 'пІдлітковий', 'пізнАння', 'пітнИй', 'піцЕрія', 'пОдруга', 'пОзначка', 'пОмИлка', 'помІщик', 'помОвчати', 'понЯття', 'порядкОвий', 'посерЕдині', 'привезтИ', 'привестИ', 'прИморозок', 'принестИ', 'прИчіп', 'промІжок', 'псевдонІм', 'рАзом', 'рЕмінь', 'рЕшето', 'рИнковий', 'рівнИна', 'роздрібнИй', 'рОзпірка', 'рукОпис', 'руслО', 'сантимЕтр', 'свЕрдло', 'серЕдина', 'сЕча', 'симетрІя', 'сільськогосподАрський', 'сімдесЯт', 'слИна', 'соломИнка', 'стАтуя', 'стовідсОтковий', 'стрибАти', 'текстовИй', 'течіЯ', 'тИгровий', 'тисОвий', 'травестЯя', 'тризУб', 'тУлуб', 'украЇнський', 'уподОбання', 'урочИстий', 'усерЕдині', 'фартУх', 'фаховИй', 'фенОмен', 'фОльга', 'фОрзац', 'цАрина', 'цемЕнт', 'цЕнтнер', 'ціннИк', 'чарівнИй', 'черговИй', 'читАння', 'чорнОзем', 'чорнОслив', 'чотирнАдцять', 'шовкОвий', 'шофЕр', 'щЕлепа', 'щИпці', 'щодобовИй', 'ярмаркОвий']

input.focus()

document.addEventListener('keydown', (e) => {
   if (e.keyCode == 13) {
      checkAnswer()
   }
})

function newQuestion() {
   random = Math.floor(Math.random() * array.length)
   text.innerHTML = array[random].toLowerCase()
   count.innerHTML = counter.toString() + ' / 220'
}

newQuestion()

function checkAnswer() {
   if (input.value !== '') {
      if (input.value == array[random]) {
         array.splice(random, 1)
         counter++
         input.value = ''
         input.focus()
         newQuestion()
         styleTrue()
         console.log(array)
      } else {
         input.value = ''
         input.focus()
         styleFalse()
      }
   }
}

function styleTrue() {
   input.style.border = '2px solid lime'
   setTimeout(() => {
      input.style.transition = 'all ease 0.5s'
      input.style.border = '1px solid #ced4da'
   }, 1000)
   input.style.transition = 'none'
}

function styleFalse() {
   input.style.border = '2px solid red'
   setTimeout(() => {
      input.style.transition = 'all ease 0.5s'
      input.style.border = '1px solid #ced4da'
   }, 1000)
   input.style.transition = 'none'
}